app/controllers/application_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movies.all

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 1 LIMIT 1
---
  def show
    @movie = Movies.find_by_id(params['id'])

INSERT INTO "movies" ("created_at", "image", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-29 13:59:26.544382"], ["image", "http://www.cityonfire.com/wp-content/uploads/2014/04/hr_Guardians_of_the_Galaxy_46.jpg"], ["updated_at", "2014-07-29 13:59:26.544382"]]
---
  def create
    g = Movies.new
    g.image = params['image']
    g.save

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 5 LIMIT 1
---
  def edit
    @movie = Movies.find_by_id(params['id'])

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 5 LIMIT 1
UPDATE "movies" SET "image" = ?, "updated_at" = ? WHERE "movies"."id" = 5  [["image", "http://upload.wikimedia.org/wikipedia/en/1/14/Lucy_(2014_film)_poster.jpg"], ["updated_at", "2014-07-29 15:18:27.220565"]]
---
  def update
    g = Movies.find_by_id(params['id'])
    g.image = params['image']
    g.save

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 1 LIMIT 1
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
  def destroy
    g = Movies.find_by_id(params['id'])
    g.destroy