app/controllers/application_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def index
    @profiles = Account.all

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = 0 LIMIT 1
---
  def show
    @profile = Account.find_by_id(params['id'])

INSERT INTO "accounts" ("caption", "created_at", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["caption", "kjfvsdjfciusmfdds"], ["created_at", "2014-07-28 16:48:32.358494"], ["name", "arda"], ["updated_at", "2014-07-28 16:48:32.358494"], ["url", "ikesonmez@hotmail.com"]]
---
  def create
    g = Account.new
    g.name = params['name']
    g.url = params['url']
    g.caption = params['caption']
    g.image = params['image']
    g.save

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = 1 LIMIT 1
---
  def edit
    @profile = Account.find_by_id(params['id'])

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = 1 LIMIT 1
UPDATE "accounts" SET "image" = ?, "updated_at" = ? WHERE "accounts"."id" = 16  [["image", "http://tmacfitness.com/wp-content/uploads/2013/04/Beauty-of-nature-random-4884759-1280-800.jpg"], ["updated_at", "2014-07-28 18:25:07.201921"]]
---
  def update
    g = Account.find_by_id(params['id'])
    g.name = params['name']
    g.url = params['url']
    g.caption = params['caption']
    g.image = params['image']
    g.save

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = 1 LIMIT 1
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]
---
  def destroy
    g = Account.find_by_id(params['id'])
    g.destroy